Revit 2026 API

# CADLinkOptions(CADLinkOptions) Constructor

---

Constructs a new copy of the input CADLinkOptions object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CADLinkOptions(
	CADLinkOptions other
)
```
```vb
Public Sub New (
	other As CADLinkOptions
)
```
```cpp
public:
CADLinkOptions(
	CADLinkOptions^ other
)
```
```fsharp
new :
        other : CADLinkOptions -> CADLinkOptions
```

#### Parameters

other CADLinkOptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

CADLinkOptions Class

CADLinkOptions Overload

Autodesk.Revit.DB Namespace